micro-ROS/micro_ros_renesas_testbench/boards/MCK_RA6T2/e2studio_project_CAN/ra_gen/hal_data.c
/* generated HAL source file - do not edit */
#include "hal_data.h"
/* Nominal and Data bit timing configuration */

can_bit_timing_cfg_t g_canfd0_bit_timing_cfg = {
/* Actual bitrate: 500000 Hz. Actual sample point: 75 %. */
.baud_rate_prescaler = 1, .time_segment_1 = 59, .time_segment_2 = 20,
		.synchronization_jump_width = 4 };

#if BSP_FEATURE_CANFD_FD_SUPPORT
can_bit_timing_cfg_t g_canfd0_data_timing_cfg =
{
    /* Actual bitrate: 2000000 Hz. Actual sample point: 75 %. */
    .baud_rate_prescaler = 1,
    .time_segment_1 = 14,
    .time_segment_2 = 5,
    .synchronization_jump_width = 1
};
#endif

extern const canfd_afl_entry_t p_canfd0_afl[CANFD_CFG_AFL_CH0_RULE_NUM];
#ifndef CANFD_PRV_GLOBAL_CFG
#define CANFD_PRV_GLOBAL_CFG

#ifdef RA_NOT_DEFINED
#undef RA_NOT_DEFINED
#endif
#define RA_NOT_DEFINED (0)

/* Buffer RAM used: RA_NOT_DEFINED bytes */
canfd_global_cfg_t g_canfd_global_cfg = { .global_interrupts =
		CANFD_CFG_GLOBAL_ERR_SOURCES, .global_config = (CANFD_CFG_TX_PRIORITY
		| CANFD_CFG_DLC_CHECK
		| (BSP_CFG_CANFDCLK_SOURCE == BSP_CLOCKS_SOURCE_CLOCK_MAIN_OSC ?
				R_CANFD_CFDGCFG_DCS_Msk : 0U) | CANFD_CFG_FD_OVERFLOW
		| ((RA_NOT_DEFINED) << R_CANFD_CFDGCFG_ITRCP_Pos)), .rx_mb_config =
		(CANFD_CFG_RXMB_NUMBER
				| (CANFD_CFG_RXMB_SIZE << R_CANFD_CFDRMNB_RMPLS_Pos)),
		.global_err_ipl = CANFD_CFG_GLOBAL_ERR_IPL, .rx_fifo_ipl =
				CANFD_CFG_RX_FIFO_IPL, .rx_fifo_config = {
				((CANFD_CFG_RXFIFO0_INT_THRESHOLD << R_CANFD_CFDRFCC_RFIGCV_Pos)
						| (CANFD_CFG_RXFIFO0_DEPTH << R_CANFD_CFDRFCC_RFDC_Pos)
						| (CANFD_CFG_RXFIFO0_PAYLOAD
								<< R_CANFD_CFDRFCC_RFPLS_Pos)
						| (CANFD_CFG_RXFIFO0_INT_MODE)
						| (CANFD_CFG_RXFIFO0_ENABLE)),
				((CANFD_CFG_RXFIFO1_INT_THRESHOLD << R_CANFD_CFDRFCC_RFIGCV_Pos)
						| (CANFD_CFG_RXFIFO1_DEPTH << R_CANFD_CFDRFCC_RFDC_Pos)
						| (CANFD_CFG_RXFIFO1_PAYLOAD
								<< R_CANFD_CFDRFCC_RFPLS_Pos)
						| (CANFD_CFG_RXFIFO1_INT_MODE)
						| (CANFD_CFG_RXFIFO1_ENABLE)),
#if !BSP_FEATURE_CANFD_LITE
				((CANFD_CFG_RXFIFO2_INT_THRESHOLD << R_CANFD_CFDRFCC_RFIGCV_Pos)
						| (CANFD_CFG_RXFIFO2_DEPTH << R_CANFD_CFDRFCC_RFDC_Pos)
						| (CANFD_CFG_RXFIFO2_PAYLOAD
								<< R_CANFD_CFDRFCC_RFPLS_Pos)
						| (CANFD_CFG_RXFIFO2_INT_MODE)
						| (CANFD_CFG_RXFIFO2_ENABLE)),
				((CANFD_CFG_RXFIFO3_INT_THRESHOLD << R_CANFD_CFDRFCC_RFIGCV_Pos)
						| (CANFD_CFG_RXFIFO3_DEPTH << R_CANFD_CFDRFCC_RFDC_Pos)
						| (CANFD_CFG_RXFIFO3_PAYLOAD
								<< R_CANFD_CFDRFCC_RFPLS_Pos)
						| (CANFD_CFG_RXFIFO3_INT_MODE)
						| (CANFD_CFG_RXFIFO3_ENABLE)),
				((CANFD_CFG_RXFIFO4_INT_THRESHOLD << R_CANFD_CFDRFCC_RFIGCV_Pos)
						| (CANFD_CFG_RXFIFO4_DEPTH << R_CANFD_CFDRFCC_RFDC_Pos)
						| (CANFD_CFG_RXFIFO4_PAYLOAD
								<< R_CANFD_CFDRFCC_RFPLS_Pos)
						| (CANFD_CFG_RXFIFO4_INT_MODE)
						| (CANFD_CFG_RXFIFO4_ENABLE)),
				((CANFD_CFG_RXFIFO5_INT_THRESHOLD << R_CANFD_CFDRFCC_RFIGCV_Pos)
						| (CANFD_CFG_RXFIFO5_DEPTH << R_CANFD_CFDRFCC_RFDC_Pos)
						| (CANFD_CFG_RXFIFO5_PAYLOAD
								<< R_CANFD_CFDRFCC_RFPLS_Pos)
						| (CANFD_CFG_RXFIFO5_INT_MODE)
						| (CANFD_CFG_RXFIFO5_ENABLE)),
				((CANFD_CFG_RXFIFO6_INT_THRESHOLD << R_CANFD_CFDRFCC_RFIGCV_Pos)
						| (CANFD_CFG_RXFIFO6_DEPTH << R_CANFD_CFDRFCC_RFDC_Pos)
						| (CANFD_CFG_RXFIFO6_PAYLOAD
								<< R_CANFD_CFDRFCC_RFPLS_Pos)
						| (CANFD_CFG_RXFIFO6_INT_MODE)
						| (CANFD_CFG_RXFIFO6_ENABLE)),
				((CANFD_CFG_RXFIFO7_INT_THRESHOLD << R_CANFD_CFDRFCC_RFIGCV_Pos)
						| (CANFD_CFG_RXFIFO7_DEPTH << R_CANFD_CFDRFCC_RFDC_Pos)
						| (CANFD_CFG_RXFIFO7_PAYLOAD
								<< R_CANFD_CFDRFCC_RFPLS_Pos)
						| (CANFD_CFG_RXFIFO7_INT_MODE)
						| (CANFD_CFG_RXFIFO7_ENABLE)),
#endif
				}, .common_fifo_config = { CANFD_CFG_COMMONFIFO0,
#if !BSP_FEATURE_CANFD_LITE
				CANFD_CFG_COMMONFIFO1, CANFD_CFG_COMMONFIFO2,
				CANFD_CFG_COMMONFIFO3, CANFD_CFG_COMMONFIFO4,
				CANFD_CFG_COMMONFIFO5,
#endif
				} };
#undef RA_NOT_DEFINED

#endif

canfd_extended_cfg_t g_canfd0_extended_cfg = { .p_afl = p_canfd0_afl,
		.txmb_txi_enable = ((1ULL << 0) | 0ULL), .error_interrupts =
				(R_CANFD_CFDC_CTR_EWIE_Msk | R_CANFD_CFDC_CTR_EPIE_Msk
						| R_CANFD_CFDC_CTR_BOEIE_Msk
						| R_CANFD_CFDC_CTR_BORIE_Msk | R_CANFD_CFDC_CTR_OLIE_Msk
						| 0U),
#if BSP_FEATURE_CANFD_FD_SUPPORT
    .p_data_timing      = &g_canfd0_data_timing_cfg,
#else
		.p_data_timing = NULL,
#endif
		.delay_compensation = (1), .p_global_cfg = &g_canfd_global_cfg, };

canfd_instance_ctrl_t g_canfd0_ctrl;
const can_cfg_t g_canfd0_cfg = { .channel = 0, .p_bit_timing =
		&g_canfd0_bit_timing_cfg, .p_callback = canfd0_callback, .p_extend =
		&g_canfd0_extended_cfg, .p_context = NULL, .ipl = (3),
#if defined(VECTOR_NUMBER_CAN0_COMFRX)
    .rx_irq             = VECTOR_NUMBER_CAN0_COMFRX,
#else
		.rx_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_CAN0_TX)
    .tx_irq             = VECTOR_NUMBER_CAN0_TX,
#else
		.tx_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_CAN0_CHERR)
    .error_irq             = VECTOR_NUMBER_CAN0_CHERR,
#else
		.error_irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const can_instance_t g_canfd0 = { .p_ctrl = &g_canfd0_ctrl, .p_cfg =
		&g_canfd0_cfg, .p_api = &g_canfd_on_canfd };
agt_instance_ctrl_t g_timer0_ctrl;
const agt_extended_cfg_t g_timer0_extend = { .count_source = AGT_CLOCK_PCLKB,
		.agto = AGT_PIN_CFG_DISABLED, .agtoab_settings_b.agtoa =
				AGT_PIN_CFG_DISABLED, .agtoab_settings_b.agtob =
				AGT_PIN_CFG_DISABLED, .measurement_mode = AGT_MEASURE_DISABLED,
		.agtio_filter = AGT_AGTIO_FILTER_NONE, .enable_pin =
				AGT_ENABLE_PIN_NOT_USED,
		.trigger_edge = AGT_TRIGGER_EDGE_RISING, .counter_bit_width =
				AGT_COUNTER_BIT_WIDTH_32, };
const timer_cfg_t g_timer0_cfg = { .mode = TIMER_MODE_PERIODIC,
/* Actual period: 0.0001 seconds. Actual duty: 50%. */.period_counts =
		(uint32_t) 0x1770, .duty_cycle_counts = 0xbb8, .source_div =
		(timer_source_div_t) 0, .channel = 0, .p_callback = micro_ros_timer_cb,
/** If NULL then do not add & */
#if defined(NULL)
    .p_context           = NULL,
#else
		.p_context = &NULL,
#endif
		.p_extend = &g_timer0_extend, .cycle_end_ipl = (12),
#if defined(VECTOR_NUMBER_AGT0_INT)
    .cycle_end_irq       = VECTOR_NUMBER_AGT0_INT,
#else
		.cycle_end_irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const timer_instance_t g_timer0 = { .p_ctrl = &g_timer0_ctrl, .p_cfg =
		&g_timer0_cfg, .p_api = &g_timer_on_agt };
void g_hal_init(void) {
	g_common_init();
}
